# 7.1 Handling Missing Data

In [2]:
import pandas as pd 
import numpy as np

string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

## 7.1.1 Filtering Out Missing Data

In [5]:
from numpy import nan as NA
data = pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1.,6.5,3.], [1.,NA,NA], [NA,NA,NA], [NA,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [11]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [13]:
data.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0 -0.714316       NaN       NaN
1 -0.314056       NaN       NaN
2  0.355283       NaN -1.027380
3  0.960344       NaN -0.038803
4 -1.261067  1.414412 -0.467968
5 -0.131264 -2.971670 -0.786510
6  0.289239 -0.593224  0.194954

In [16]:
df.dropna()

          0         1         2
4 -1.261067  1.414412 -0.467968
5 -0.131264 -2.971670 -0.786510
6  0.289239 -0.593224  0.194954

In [17]:
df.dropna(thresh = 2)

          0         1         2
2  0.355283       NaN -1.027380
3  0.960344       NaN -0.038803
4 -1.261067  1.414412 -0.467968
5 -0.131264 -2.971670 -0.786510
6  0.289239 -0.593224  0.194954

## 7.1.2 Filling in Missing Data

In [18]:
df.fillna(0)

          0         1         2
0 -0.714316  0.000000  0.000000
1 -0.314056  0.000000  0.000000
2  0.355283  0.000000 -1.027380
3  0.960344  0.000000 -0.038803
4 -1.261067  1.414412 -0.467968
5 -0.131264 -2.971670 -0.786510
6  0.289239 -0.593224  0.194954

In [19]:
df.fillna({1:0.5, 2:0})

          0         1         2
0 -0.714316  0.500000  0.000000
1 -0.314056  0.500000  0.000000
2  0.355283  0.500000 -1.027380
3  0.960344  0.500000 -0.038803
4 -1.261067  1.414412 -0.467968
5 -0.131264 -2.971670 -0.786510
6  0.289239 -0.593224  0.194954

In [21]:
_ = df.fillna(0,inplace = True)
df

          0         1         2
0 -0.714316  0.000000  0.000000
1 -0.314056  0.000000  0.000000
2  0.355283  0.000000 -1.027380
3  0.960344  0.000000 -0.038803
4 -1.261067  1.414412 -0.467968
5 -0.131264 -2.971670 -0.786510
6  0.289239 -0.593224  0.194954

In [25]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA
df

          0         1         2
0  0.543236  0.234429 -0.251837
1  0.683860  0.266502 -1.039882
2 -0.555722       NaN -0.417439
3  2.284763       NaN  0.027722
4 -0.188163       NaN       NaN
5  1.021408       NaN       NaN

In [26]:
df.fillna(method = 'ffill')

          0         1         2
0  0.543236  0.234429 -0.251837
1  0.683860  0.266502 -1.039882
2 -0.555722  0.266502 -0.417439
3  2.284763  0.266502  0.027722
4 -0.188163  0.266502  0.027722
5  1.021408  0.266502  0.027722

In [28]:
df.fillna(method = 'ffill',limit = 2)

          0         1         2
0  0.543236  0.234429 -0.251837
1  0.683860  0.266502 -1.039882
2 -0.555722  0.266502 -0.417439
3  2.284763  0.266502  0.027722
4 -0.188163       NaN  0.027722
5  1.021408       NaN  0.027722

In [29]:
data = pd.Series([1.,NA,3.5,NA,7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 7.2 Data Transformation

## 7.2.1 Removing Duplicates

In [30]:
data = pd.DataFrame({'k1':['one','two'] * 3 + ['two'],
                     'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [31]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [32]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [33]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [34]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [35]:
data.drop_duplicates(['k2'])

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

In [37]:
data.drop_duplicates(['k1','k2'], keep = 'last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## 7.2.2 Transforming Data Using a Function or Mapping

In [38]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon',
                             'Pastrami','corned beef','Bacon',
                             'pastrami','honey ham','nova lox'],
                     'ounces':[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [39]:
meat_to_animal = {
    'bacon' : 'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox': 'salmon'
}

In [40]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [41]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [43]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## 7.2.3 Replacing Values

In [44]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [45]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [46]:
data.replace([-999,-1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [47]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [48]:
data.replace({-999: np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## 7.2.4 Renaming Axis Indexes

In [49]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                    index = ['Ohio','Colorado','New York'],
                    columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [50]:
transform = lambda x:x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [53]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [54]:
data.rename(index = str.title, columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [55]:
data.rename(index = {'OHIO':'INDIANA'},
            columns = {'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [57]:
data.rename(index = {'OHIO':'INDIANA'}, inplace = True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## 7.2.5 Discretization and Binning

In [59]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

bins = [18,25,35,60,100]

cats = pd.cut(ages, bins)

cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [60]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [61]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [62]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [63]:
pd.cut(ages, [18,26,36,61,100], right = False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [64]:
group_names = ['Youth','YoungAdult','MiddleAged','Senior']
pd.cut(ages, bins, labels = group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [65]:
data = np.random.rand(20)
pd.cut(data, 4, precision = 2)

[(0.47, 0.7], (0.7, 0.93], (0.24, 0.47], (0.47, 0.7], (0.014, 0.24], ..., (0.7, 0.93], (0.47, 0.7], (0.47, 0.7], (0.7, 0.93], (0.014, 0.24]]
Length: 20
Categories (4, interval[float64]): [(0.014, 0.24] < (0.24, 0.47] < (0.47, 0.7] < (0.7, 0.93]]

In [66]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4)
cats

[(0.628, 3.071], (0.628, 3.071], (-0.0258, 0.628], (-2.847, -0.792], (-0.0258, 0.628], ..., (0.628, 3.071], (-0.792, -0.0258], (-0.792, -0.0258], (0.628, 3.071], (-0.0258, 0.628]]
Length: 1000
Categories (4, interval[float64]): [(-2.847, -0.792] < (-0.792, -0.0258] < (-0.0258, 0.628] < (0.628, 3.071]]

In [67]:
pd.value_counts(cats)

(0.628, 3.071]       250
(-0.0258, 0.628]     250
(-0.792, -0.0258]    250
(-2.847, -0.792]     250
dtype: int64

In [68]:
pd.qcut(data, [0,0.1,0.5,0.9,1.])

[(1.198, 3.071], (1.198, 3.071], (-0.0258, 1.198], (-1.331, -0.0258], (-0.0258, 1.198], ..., (1.198, 3.071], (-1.331, -0.0258], (-1.331, -0.0258], (-0.0258, 1.198], (-0.0258, 1.198]]
Length: 1000
Categories (4, interval[float64]): [(-2.847, -1.331] < (-1.331, -0.0258] < (-0.0258, 1.198] < (1.198, 3.071]]

## 7.2.6 Detecting and Filtering Outliers

In [69]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.067875    -0.016803    -0.019825    -0.001925
std       0.981414     1.018655     1.011749     1.007289
min      -2.742951    -3.273044    -4.234101    -3.797839
25%      -0.631224    -0.669418    -0.678683    -0.699885
50%       0.040562    -0.036725     0.021241     0.004217
75%       0.716916     0.629164     0.629417     0.703568
max       2.908559     3.204978     3.348976     2.996283

In [70]:
col = data[2]
col[np.abs(col) > 3]

646   -3.321506
650   -3.091063
791   -4.234101
994    3.348976
Name: 2, dtype: float64

In [71]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
5    2.119071  0.705398  0.292009 -3.797839
144 -0.134540  3.190796  0.774496 -0.260216
154 -0.039327 -3.119089 -1.076251  0.863382
364  0.615342 -3.273044  0.164572  0.468412
465  0.628888  3.204978 -0.494630 -0.550126
646  2.347573 -1.820406 -3.321506  0.614205
650  1.116444 -1.372377 -3.091063  0.352175
791  0.582288  0.071179 -4.234101 -0.237243
994 -1.586502  0.507809  3.348976  0.841753

In [73]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.067875    -0.016807    -0.018527    -0.001127
std       0.981414     1.016247     1.004959     1.004592
min      -2.742951    -3.000000    -3.000000    -3.000000
25%      -0.631224    -0.669418    -0.678683    -0.699885
50%       0.040562    -0.036725     0.021241     0.004217
75%       0.716916     0.629164     0.629417     0.703568
max       2.908559     3.000000     3.000000     2.996283

In [74]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0  1.0
1 -1.0 -1.0  1.0 -1.0
2  1.0 -1.0 -1.0  1.0
3 -1.0 -1.0 -1.0 -1.0
4  1.0  1.0  1.0 -1.0

## 7.2.7 Permutation and Random Sampling

In [76]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5,4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [77]:
sampler = np.random.permutation(5)
sampler

array([0, 4, 3, 1, 2])

In [78]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7
2   8   9  10  11

In [79]:
df.sample(n = 3)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15

In [80]:
choices = pd.Series([5,7,-1,6,4])
draws = choices.sample(n = 10, replace = True)
draws

4    4
0    5
2   -1
2   -1
1    7
0    5
3    6
1    7
3    6
0    5
dtype: int64

## 7.2.8 Computing Indicator / Dummy Variables

In [81]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'], 
                   'data1':range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [82]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [83]:
dummies = pd.get_dummies(df['key'], prefix = 'key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [84]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [86]:
mnames = ['movie_id', 'title','genres']
movies = pd.read_table('/Users/boyuan/Desktop/OneDrive - Duke University/Data Science Box/Python/Python for data analysis 2nd/datasets/movielens/movies.dat', sep = '::', header = None, names = mnames)
movies[:10]

/Users/boyuan/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead.

/Users/boyuan/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [87]:
all_genres = []

for x in movies.genres:
    all_genres.extend(x.split('|'))
    
genres = pd.unique(all_genres)

genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [88]:
zero_matrix = np.zeros((len(movies), len(genres)))

dummies = pd.DataFrame(zero_matrix, columns = genres)

gen = movies.genres[0]

gen.split('|')

['Animation', "Children's", 'Comedy']

In [89]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [90]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [91]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [92]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [93]:
bins = [0,0.2,0.4,0.6,0.8,1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# 7.3 String Manipulation

## 7.3.1 String Object Methods

In [94]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [95]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [96]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [97]:
'::'.join(pieces)

'a::b::guido'

In [98]:
'guido' in val

True

In [99]:
val.index(',')

1

In [100]:
val.find(':')

-1

In [101]:
val.index(':')

ValueError: substring not found

In [102]:
val.count(",")

2

In [103]:
val.replace(',','::')

'a::b:: guido'

In [104]:
val.replace(',','')

'ab guido'

## 7.3.2 Regular Expressions

In [106]:
import re

text = "foo    bar\t baz   \tqux"

re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [107]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [108]:
regex.findall(text)

['    ', '\t ', '   \t']

In [109]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [111]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [112]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [113]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [114]:
m = regex.search(text)
m

In [115]:
text[m.start():m.end()]

'dave@google.com'

In [116]:
print(regex.match(text))

None

In [117]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [118]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [119]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [120]:
m = regex.match('wesm@bright.net')

In [121]:
m.groups()

('wesm', 'bright', 'net')

In [122]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [123]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

## 7.3.3 Vectorized String Functions in pandas

In [124]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [125]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [126]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [127]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [128]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [129]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [130]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [131]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [132]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

# 7.4 Conclusion